app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("name", "priority", "completed_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Watch video about CRUD"], ["priority", 8], ["completed_at", "2020-01-19 20:43:00"], ["created_at", "2020-01-19 20:43:34.580459"], ["updated_at", "2020-01-19 20:43:34.580459"]]